---
kind: type
id: T:Autodesk.Revit.DB.ACADExportOptions
source: html/acd35939-8664-f5aa-2287-3eedb8cfdafc.htm
---
# Autodesk.Revit.DB.ACADExportOptions

The base class for options used to export DWG and DXF format files.

## Syntax (C#)
```csharp
public class ACADExportOptions : BaseExportOptions
```